
## Terrafom Analysis ⚙️

| Format & Style               | Init                          | Validation                        | Plan                          |
| ---------------------------- | ----------------------------- | --------------------------------- | ----------------------------- |
| `success` | `success` | `success` | `success` |

### Validation details:
<details><summary>Output</summary>

```

Success! The configuration is valid.


```

</details>

### Plan details:
<details><summary>Output</summary>

```

Plan results: 

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backup_config.azurerm_backup_policy_vm.backup_policy["test"] will be created
  + resource "azurerm_backup_policy_vm" "backup_policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = 27
      + name                           = "test"
      + policy_type                    = "V2"
      + recovery_vault_name            = "recovery-vault-test"
      + resource_group_name            = "test-rg"
      + timezone                       = "UTC"

      + backup {
          + frequency     = "Hourly"
          + hour_duration = 4
          + hour_interval = 4
          + time          = "23:00"
        }

      + retention_daily {
          + count = 30
        }

      + retention_monthly {
          + count    = 2
          + weekdays = [
              + "Sunday",
              + "Wednesday",
            ]
          + weeks    = [
              + "First",
              + "Last",
            ]
        }

      + retention_weekly {
          + count    = 2
          + weekdays = [
              + "Friday",
              + "Saturday",
              + "Sunday",
              + "Wednesday",
            ]
        }

      + retention_yearly {
          + count    = 77
          + months   = [
              + "January",
            ]
          + weekdays = [
              + "Sunday",
            ]
          + weeks    = [
              + "Last",
            ]
        }
    }

  # module.backup_config.azurerm_backup_policy_vm.backup_policy["test2"] will be created
  + resource "azurerm_backup_policy_vm" "backup_policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = 3
      + name                           = "test2"
      + policy_type                    = "V1"
      + recovery_vault_name            = "recovery-vault-test"
      + resource_group_name            = "test-rg"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "23:00"
        }

      + retention_daily {
          + count = 30
        }

      + retention_monthly {
          + count    = 2
          + weekdays = [
              + "Sunday",
              + "Wednesday",
            ]
          + weeks    = [
              + "First",
              + "Last",
            ]
        }

      + retention_weekly {
          + count    = 2
          + weekdays = [
              + "Friday",
              + "Saturday",
              + "Sunday",
              + "Wednesday",
            ]
        }

      + retention_yearly {
          + count    = 77
          + months   = [
              + "January",
            ]
          + weekdays = [
              + "Sunday",
            ]
          + weeks    = [
              + "Last",
            ]
        }
    }

  # module.backup_config.azurerm_backup_protected_vm.protected_azvm["/subscriptions/7XXdXX9d-XXXX-XXXX-XXXX-787XX8XXf4XX/resourceGroups/RXXXXXXXX/providers/Microsoft.Compute/virtualMachines/XXXXX"] will be created
  + resource "azurerm_backup_protected_vm" "protected_azvm" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + recovery_vault_name = "recovery-vault-test"
      + resource_group_name = "test-rg"
      + source_vm_id        = "/subscriptions/7XXdXX9d-XXXX-XXXX-XXXX-787XX8XXf4XX/resourceGroups/RXXXXXXXX/providers/Microsoft.Compute/virtualMachines/XXXXX"
    }

  # module.backup_config.azurerm_recovery_services_vault.recovery_vault will be created
  + resource "azurerm_recovery_services_vault" "recovery_vault" {
      + cross_region_restore_enabled  = false
      + id                            = (known after apply)
      + immutability                  = (known after apply)
      + location                      = "eastus"
      + name                          = "recovery-vault-test"
      + public_network_access_enabled = true
      + resource_group_name           = "test-rg"
      + sku                           = "Standard"
      + soft_delete_enabled           = true
      + storage_mode_type             = "LocallyRedundant"
      + tags                          = {
          + "test" = "test"
        }
    }

  # module.backup_config.azurerm_resource_group.resource_group[0] will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "test-rg"
      + tags     = {
          + "test" = "test"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

### Errors:
<details><summary>Output</summary>

```

Errors in plan: 

```

</details>

*Pusher: @shoootyou, Action: `pull_request`, Workflow: `Terraform Analysis`*